using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Game
{
    
    class Questions
    {
        public static List<String> OsQuestion = new List<string>() { "Процеси се програми во извршување", "Nov proces se kreira so:", "Дали доколку графот нема циклуси може да се заклучи дека нема блокада?", "4.	Dokolku барањата се распоредуваат како што пристигнуваат во редицата на чекање се применува кое распоредување?", "Блокадите се потенцијален проблем за секој систем." };
        public static List<String> OsAnswers = new List<string>() { "Да Не", "fork(), - exec()", "Да Не", "SSTF FIFO", "Точно Неточно"};
        public static List<String> AokQuestion = new List<string>() { "Кај МИПС операндите во аритметичките инструкции се земаат од:", "Терабајт може да се претстави како: ", "Компајлерот преведува:", "Пример за пренослива меморија е:", "Чиповите се создадени главно од:" };
        public static List<String> AokAnswers = new List<string>() { "Регистри РОМ меморија", "10 на степен 12 бајти  или 10 на степен 20 бајти", "од програмски во машински јазик од програмски во асемблерски јазик", "РАМ оптички дискови", "Проводници Полупроводници" };
        public static List<String> SiQuestion = new List<string>() {"Цената на софтверот често ја надминува цената на компјутерскиот систем на кој тој работи.", "Cenata na softverot e cesto povisoka od cenata za negovo odrzuvanje?", "Проблем поврзан со акција или работна задача на софтверското инженерство дефинира кој патерн?", "Waterfall modelot spagja vo koi procesni modeli:", "Koи методи претпочитаат лице-в- лице комуникација наместо пишани документи?", "Kvalitetot na krajniot produkt mnogu zavisi od:" };
        public static List<String> SiAnswers = new List<string>() { "Toчно Неточно", "Toчно Неточно", "Stage pattern, Task pattern","Пропишани или класични Агилни", "Класични Агилни", "Дизајнот Тестирање" };
        public static List<String> SpQuestion = new List<string>() { "Сите логички изрази се пресметуваат одлево надесно?", "Сите унарни оператори имаат повисок приоритет од бинарните?", "Dali slednata definirana funkcija e ispravna? int add_numbers( float n1, float n2 ) { return 6.0; }", "Променливите кои постојат само во рамките на функциите и блоковите наредби во кои се креирани се нарекуваат?", ". Секоја рекурзивен алгоритам мора да има основен(граничен случај)?" };
        public static List<String> SpAnswers = new List<string>() { "Точно Неточно", "Точно Неточно", "Да Не", "Локални Глобални", "Точно Неточно" };
        public static List<String> MaQuestion = new List<string>() { "Маркетинг е процес со кој компаниите креираат вредност за клиентите и градат цврст однос со клиентите за да добијат вредност од клиентите за возврат.", "Комбинација на производи, услуги, информации или  искуства кои се нудат на пазарот за да задоволат потреба или желба претставува:", "Размена е чин на на добивање на посакуваниот објект од некого, нудејќи нешто за возврат.", "идејата дека потрошувачите ќе ги фаворизираат производите кои се достапни и кои се со пристапни цени претставува концепт на:", "Таргетиран маркетинг се однесува на делење на пазарот на сегменти на клиенти?" };
        public static List<String> MaAnswers = new List<string>() { "Да Не", "Понуда Побарувачка", "Да Не","Концепт на производство Концепт на продажба", "Да Не"};

      
    }
}
